Revit 2027 API
BuiltInFailures.StairRampFailures.StringerCurvesNotSplitStairs Property
 The slope of stringer may not parallel runs and landings. To get a parallel stringer, split boundary lines at the ends of landings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StringerCurvesNotSplitStairs { get; }
Public Shared ReadOnly Property StringerCurvesNotSplitStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StringerCurvesNotSplitStairs {
	FailureDefinitionId^ get ();
}
static member StringerCurvesNotSplitStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace